# 大学计算机基础

## 数试、化生

### 学分学时

3学分。大一上，基本上是每周一次课，有时会改成线上学习。下半学期每周上机，附带答疑功能，但不强制。

### 课程考核标准

期中20%、平时成绩（作业）20%、期末60%

### 课程要点

大学计算机基础（大计基），主要可以分成两个部分，期中考试前是计算机的结构、原理和基础知识，期中考试后是C语言及编程。作业为C语言的练习题，每一周大约8-12道。该课程比较难，需要引起重视。

### 学习技巧

计教中心的老师更偏向于利用网络资源进行教学，所以MOOC能看的内容他们是绝对不会线下再讲一遍的。也就是说，*上课只讲重点*，**自学**是主要的方式。自己不花大量精力，是肯定跟不上进度的。

上半学期的内容对下半学期算是做铺垫的作用，但是内容杂乱，学习方式以看书、看MOOC**记忆**为主。学习方法可以说类似于思政课，平常正常跟进度，期中考前突击就行了。如果可以的话，可以做一份提纲来背（当然也欢迎分享给学辅）。但可以说，崔老师的课是相当精彩的。

下半学期的内容是对C语言思想（或者说面向过程编程思想）的了解。“学C语言就和学英语一样”，刚开始要记一些语法，到后来主要是应用：用来做作业的时间远远大于看书看MOOC。

做作业一定要认真，这是本课程学习的关键部分。作业会让同学们设计解决一些数学问题和抽象、简化后的实际问题，最后还包括对线性表这种数据结构的初体验。在作业过程中，通过实现一些简单的算法，想清楚解决问题的每一个步骤，同学们训练了自己的思维能力。根据老师所说，**“自顶向下，逐步求精”**是学习本课程的C语言需要时刻牢记的八个字，这便是设计算法的思想：通过把程序写成多个分函数的方式，一步步解决问题。
期末考试的编程题很简单，主要考的是语法，背诵的成分比你想象中要多。所以考前要认真过一遍课本，把课本上的例子、课后题在VS里敲一遍，以体会其思想。“最怕的就是只看不做”。

学有余力的话，可以去做北大、浙大、杭电的OJ平台上的题（老师推荐）。

（注：带引号大概是崔老师的原话）
